#pragma once
#include "stdafx.h"
/********************************************************************************************/
/* CNumberクラスヘッダ																		*/
/*------------------------------------------------------------------------------------------*/
/*[作成]		<作成者><作成日><バージョン‐リビジョン>									*/
/*				<白戸><20080110>　Initial Version.                                          */
/*------------------------------------------------------------------------------------------*/
/*[修正来歴]	<修正者><修正日><バージョン‐リビジョン><障害管理番号><修正内容>	    	*/
/*                                                                          				*/
/*------------------------------------------------------------------------------------------*/
/********************************************************************************************/

class CNumber
{
public:
	CNumber(void);
	~CNumber(void);

	BOOL ConvertBankNummber(CString strBank, UINT* puiBank);		//バンク番号変換
	BOOL ConvertTemlateNummber(CString strTemp, UINT* puiTemp);		//テンプレート番号変換

};
