#include "H1EUSB_Number.h"
/********************************************************************************************/
/* CNumberクラスプログラム																	*/
/*------------------------------------------------------------------------------------------*/
/*[作成]		<作成者><作成日><バージョン‐リビジョン>									*/
/*				<白戸><20120110>　Initial Version.                                          */
/*------------------------------------------------------------------------------------------*/
/*[修正来歴]	<修正者><修正日><バージョン‐リビジョン><障害管理番号><修正内容>	    	*/
/*                                                                          				*/
/********************************************************************************************/
CNumber::CNumber(void)
{
}

CNumber::~CNumber(void)
{
}
/********************************************************************************************/
/*[メソッド名] バンクナンバー変換															*/
/*------------------------------------------------------------------------------------------*/
/*[宣言]		BOOL ConvertBankNummber(CString strBank, UINT* puiBank)						*/
/*																							*/
/*------------------------------------------------------------------------------------------*/
/*[内容]		バンク番号をCString型⇒UINT型へ変換し、合理性をチェックする					*/
/*------------------------------------------------------------------------------------------*/
/*[戻り値]		正常終了：TRUE																*/
/********************************************************************************************/
BOOL CNumber::ConvertBankNummber(CString strBank, UINT* puiBank)
{
	UINT uiBank;
	int iReturn;

	//大文字に一度変換する
	strBank.MakeUpper();
	if(strBank.IsEmpty()){
		//文字列がない
		return FALSE;
	}
	//16進文字列⇒数値に変換
	iReturn = _stscanf(strBank, "%x", &uiBank);
	if(iReturn == 0){
		//16進文字列以外
		return FALSE;
	}
	if(uiBank>0xFFFF){
		//規定の最大バンク番号を超えてる
		return FALSE;
	}
	*puiBank = uiBank;
	return TRUE;
}

/********************************************************************************************/
/*[メソッド名] テンプレート番号変換															*/
/*------------------------------------------------------------------------------------------*/
/*[宣言]		BOOL ConvertTemlateNummber(CString strTemp, UINT* puiTemp)					*/
/*																							*/
/*------------------------------------------------------------------------------------------*/
/*[内容]		テンプレート番号をCString型⇒UINT型へ変換し、合理性をチェックする			*/
/*------------------------------------------------------------------------------------------*/
/*[戻り値]		正常終了：TRUE																*/
/********************************************************************************************/
BOOL CNumber::ConvertTemlateNummber(CString strTemp, UINT* puiTemp)
{
	UINT uiTemp;
	int iReturn;

	//大文字に一度変換する
	strTemp.MakeUpper();
	if(strTemp.IsEmpty()){
		//文字列がない
		return FALSE;
	}
	//16進文字列⇒数値に変換
	iReturn = _stscanf(strTemp, "%x", &uiTemp);
	if(iReturn == 0){
		//16進文字列以外
		return FALSE;
	}
	if(uiTemp>0x63){
		//規定の最大テンプレート番号を超えてる
		return FALSE;
	}
	*puiTemp = uiTemp;
	return TRUE;
}

